In [1]:
%pip install pandas as pd

Requirement already satisfied: pandas in c:\users\dell\appdata\local\programs\python\python312\lib\site-packages (2.2.3)
Note: you may need to restart the kernel to use updated packages.

ERROR: Could not find a version that satisfies the requirement as (from versions: none)
ERROR: No matching distribution found for as

In [2]:
import pandas as pd
import numpy as np

In [7]:
df=pd.read_csv('sample_employees.csv')
df.head()
df.tail()

   id     name department   salary   age       city
2   3  Charlie         IT  70000.0  35.0      Delhi
3   4    David    Finance      NaN  40.0  Bangalore
4   5      Eva         HR  55000.0   NaN      Delhi
5   6    Frank    Finance  65000.0  28.0     Mumbai
6   7    Grace         IT  60000.0  30.0     Mumbai

In [4]:
df.isnull().sum()

id            0
name          0
department    0
salary        1
age           1
city          0
dtype: int64

In [6]:
df.isna().any()

id            False
name          False
department    False
salary         True
age            True
city          False
dtype: bool

In [9]:
df.drop_duplicates(inplace=True)
df

   id     name department   salary   age       city
0   1    Alice         HR  50000.0  25.0      Delhi
1   2      Bob         IT  60000.0  30.0     Mumbai
2   3  Charlie         IT  70000.0  35.0      Delhi
3   4    David    Finance      NaN  40.0  Bangalore
4   5      Eva         HR  55000.0   NaN      Delhi
5   6    Frank    Finance  65000.0  28.0     Mumbai
6   7    Grace         IT  60000.0  30.0     Mumbai

In [10]:
df.iloc[1]

id                  2
name              Bob
department         IT
salary        60000.0
age              30.0
city           Mumbai
Name: 1, dtype: object

In [11]:
df.loc[1]

id                  2
name              Bob
department         IT
salary        60000.0
age              30.0
city           Mumbai
Name: 1, dtype: object

In [12]:
df2=pd.read_csv('sample_employees.csv')

In [13]:
df3=pd.merge(df,df2,on="id",how="inner")

In [14]:
df3.head()

,id,name_x,department_x,salary_x,age_x,city_x,name_y,department_y,salary_y,age_y,city_y
0,1,Alice,HR,50000.0,25.0,Delhi,Alice,HR,50000.0,25.0,Delhi
1,2,Bob,IT,60000.0,30.0,Mumbai,Bob,IT,60000.0,30.0,Mumbai
2,3,Charlie,IT,70000.0,35.0,Delhi,Charlie,IT,70000.0,35.0,Delhi
3,4,David,Finance,NaN,40.0,Bangalore,David,Finance,NaN,40.0,Bangalore
4,5,Eva,HR,55000.0,NaN,Delhi,Eva,HR,55000.0,NaN,Delhi

In [ ]:
df3["salary_x"].apply(lambda x: x*2) #column operation

0    100000.0
1    120000.0
2    140000.0
3         NaN
4    110000.0
5    130000.0
6    120000.0
Name: salary_x, dtype: float64

In [ ]:
id_times_2 = df3.apply(lambda x: x*2) #entire dataframe operation
id_times_2.head()

0     4
1     8
2    12
3    16
4    20
Name: id, dtype: int64

In [ ]:
df.groupby("department")["salary"].mean() #group by operation and mean of salary column

department
Finance    65000.000000
HR         52500.000000
IT         63333.333333
Name: salary, dtype: float64

In [35]:
df.sort_values(by=["salary","age"],ascending=True)

   id     name department   salary   age       city
0   1    Alice         HR  50000.0  25.0      Delhi
4   5      Eva         HR  55000.0   NaN      Delhi
1   2      Bob         IT  60000.0  30.0     Mumbai
6   7    Grace         IT  60000.0  30.0     Mumbai
5   6    Frank    Finance  65000.0  28.0     Mumbai
2   3  Charlie         IT  70000.0  35.0      Delhi
3   4    David    Finance      NaN  40.0  Bangalore

In [37]:
df.dropna()

   id     name department   salary   age    city
0   1    Alice         HR  50000.0  25.0   Delhi
1   2      Bob         IT  60000.0  30.0  Mumbai
2   3  Charlie         IT  70000.0  35.0   Delhi
5   6    Frank    Finance  65000.0  28.0  Mumbai
6   7    Grace         IT  60000.0  30.0  Mumbai

In [38]:
df.fillna(0)

   id     name department   salary   age       city
0   1    Alice         HR  50000.0  25.0      Delhi
1   2      Bob         IT  60000.0  30.0     Mumbai
2   3  Charlie         IT  70000.0  35.0      Delhi
3   4    David    Finance      0.0  40.0  Bangalore
4   5      Eva         HR  55000.0   0.0      Delhi
5   6    Frank    Finance  65000.0  28.0     Mumbai
6   7    Grace         IT  60000.0  30.0     Mumbai